---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorLayoutPattern
source: html/589a9a33-8fb4-441f-e870-61d554d5ade5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorLayoutPattern Property

"Major Layout Pattern": Major Layout Pattern

## Syntax (C#)
```csharp
public static ForgeTypeId FabricSheetMajorLayoutPattern { get; }
```